    |\^/|     Maple 11 (IBM INTEL LINUX)
._|\|   |/|_. Copyright (c) Maplesoft, a division of Waterloo Maple Inc. 2007
 \  MAPLE  /  All rights reserved. Maple is a trademark of
 <____ ____>  Waterloo Maple Inc.
      |       Type ? for help.
> read "MGCD.mpl":
> 
#Question 1 (B)
#PartI
> c:=x^3+y^3+z^3+1: d:=x^3-y^3-z^3+1:
> g:=x^4-123454321*y*z^2*x^2+1:
> MGCD(c,d,[x,y,z]);
 p=1013
 z=1
 y=1
 y=2
 z=2
 y=1
 y=2
 p=1019
 z=1
 y=1
 y=2
 z=2
 y=1
 y=2
                                       1

> MGCD(expand(g*c),expand(g*d),[x,y,z]);
 p=1013
 z=1
 y=1
 y=2
 y=3
 z=2
 y=1
 y=2
 y=3
 z=3
 y=1
 y=2
 y=3
 z=4
 y=1
 y=2
 y=3
 p=1019
 z=1
 y=1
 y=2
 y=3
 z=2
 y=1
 y=2
 y=3
 z=3
 y=1
 y=2
 y=3
 z=4
 y=1
 y=2
 y=3
 p=1021
 z=1
 y=1
 y=2
 y=3
 z=2
 y=1
 y=2
 y=3
 z=3
 y=1
 y=2
 y=3
 z=4
 y=1
 y=2
 y=3
 p=1031
 z=1
 y=1
 y=2
 y=3
 z=2
 y=1
 y=2
 y=3
 z=3
 y=1
 y=2
 y=3
 z=4
 y=1
 y=2
 y=3
                            4                2  2
                           x  - 123454321 y z  x  + 1

> MGCD(expand(g^2*c),expand(g^2*d),[x,y,z]);
 p=1013
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
bytes used=4000264, alloc=3538296, time=0.14
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
 y=4
 z=6
 y=1
 y=2
 y=3
 y=4
 p=1019
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
 y=4
 z=6
 y=1
 y=2
 y=3
 y=4
 p=1021
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
 y=4
 z=6
 y=1
 y=2
 y=3
 y=4
 p=1031
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
 y=4
 z=6
 y=1
bytes used=8001224, alloc=4259060, time=0.29
 y=2
 y=3
 y=4
 p=1033
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
 y=4
 z=6
 y=1
 y=2
 y=3
 y=4
 p=1039
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
 y=4
 z=6
 y=1
 y=2
 y=3
 y=4
 p=1049
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
 y=4
 z=6
 y=1
 y=2
 y=3
 y=4
 8              6    2      4                      2  4  4                2  2
x  - 246908642 x  y z  + 2 x  + 15240969373571041 y  z  x  - 246908642 y z  x

     + 1

> 
> 
#PartII
> g:=z*y*x^3+1: c:=(z-1)*x+y+1: d := (z^2-1)*x+y+1:
> MGCD(expand(g*c),expand(g*d),[x,y,z]);
 p=1013
 z=2
 y=1
 y=2
 y=3
 z=3
bytes used=12002296, alloc=4259060, time=0.44
 y=1
 y=2
 y=3
 z=4
 y=1
 y=2
 y=3
 z=5
 y=1
 y=2
 y=3
 p=1019
 z=2
 y=1
 y=2
 y=3
 z=3
 y=1
 y=2
 y=3
 z=4
 y=1
 y=2
 y=3
 z=5
 y=1
 y=2
 y=3
                                        3
                                   z y x  + 1

> 
> 
#PARTIII
> g:=x^4+z^2*y^2*x^2+1: c:=x^4+z*y*x^2+1: d:=x^4+1:
> MGCD(expand(g*c),expand(g*d),[x,y,z]);
 p=1013
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 p=1019
 z=1
 y=1
 y=2
 y=3
 y=4
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
                                4    2  2  2
                               x  + z  y  x  + 1

> 
> 
#PARTIV
> g:=x^4+z^2*y^2*x^2+1: c:=z*x^4+z*x^2+y: d:=z*x^4+z^2*x^2+y:
> MGCD(expand(g*c),expand(g*d),[x,y,z]);\
quit
 p=1013
 z=1
 y=1
 y=2
 y=3
 y=4
 y=5
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
 y=4
 z=6
 y=1
 y=2
 y=3
 y=4
 p=1019
 z=1
 y=1
 y=2
 y=3
 y=4
 y=5
 z=2
 y=1
 y=2
 y=3
 y=4
 z=3
 y=1
 y=2
 y=3
 y=4
 z=4
 y=1
 y=2
 y=3
 y=4
 z=5
 y=1
 y=2
 y=3
bytes used=16003596, alloc=4324584, time=0.60
 y=4
 z=6
 y=1
 y=2
 y=3
 y=4
                                4    2  2  2
                               x  + z  y  x  + 1

bytes used=16346012, alloc=4324584, time=0.61
